       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROCONTA.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT ARQ-CONTAS ASSIGN TO UT-S-ENTRADA.

       DATA DIVISION.
       FILE SECTION.
       FD  ARQ-CONTAS
           RECORDING MODE IS F
           BLOCK CONTAINS 0 RECORDS
           RECORD CONTAINS 54 CHARACTERS
           LABEL RECORDS ARE STANDARD.
       01  REG-CONTA-IN COPY CONTACB.

       WORKING-STORAGE SECTION.
           01 WS-FS-CONTAS        PIC X(02) VALUE SPACES.
           01 WS-FIM              PIC X(01) VALUE 'N'.
           01 WS-TOTAL-CONTAS     PIC 9(05) VALUE ZEROS.
           01 WS-TOTAL-SALDO      PIC S9(11)V99 VALUE ZEROS.
           01 WS-SALDO-EDITADO    PIC ZZZ.ZZZ.ZZZ,99.

       PROCEDURE DIVISION.
       000-MAIN.
           OPEN INPUT ARQ-CONTAS
           DISPLAY '--- LISTA DE CONTAS BANCARIAS ---'

           PERFORM  100-LER-CONTA.
           PERFORM  200-PROCESSA-CONTA UNTIL WS-FIM = 'S'.

           MOVE WS-TOTAL-SALDO TO WS-SALDO-EDITADO.
           DISPLAY '================================'.
           DISPLAY 'TOTAL DE CONTAS: ' WS-TOTAL-CONTAS.
           DISPLAY 'SALDO TOTAL:     ' WS-SALDO-EDITADO.
           CLOSE ARQ-CONTAS.
           STOP RUN.

       100-LER-CONTA.
           READ ARQ-CONTAS AT END MOVE 'S' TO WS-FIM.
       200-PROCESSA-CONTA.
           ADD 1 TO WS-TOTAL-CONTAS.
           ADD SALDO TO WS-TOTAL-SALDO.
           DISPLAY 'CONTA:   ' NUM-CONTA.
           DISPLAY 'CLIENTE: ' NOME-CLIENTE.
           DISPLAY 'AGENCIA: ' AGENCIA.
           DISPLAY 'TIPO:    ' TIPO-CONTA.
           MOVE SALDO TO WS-SALDO-EDITADO.
           DISPLAY 'SALDO:   ' WS-SALDO-EDITADO.
           DISPLAY ' '.
           PERFORM 100-LER-CONTA.
